{
  "easy": [
    "apple",
    "banana",
    "watermelon",
    "grape",
    "orange",
    "table",
    "chair",
    "window",
    "bed",
    "book",
    "pen",
    "paper",
    "mobile phone",
    "computer",
    "dog",
    "cat",
    "bird",
    "fish",
    "rabbit",
    "red",
    "blue",
    "green",
    "yellow",
    "black",
    "milk",
    "water",
    "tea",
    "coffee",
    "juice",
    "father",
    "mother",
    "older brother",
    "older sister",
    "younger brother",
    "younger sister",
    "friend",
    "teacher",
    "classmate",
    "child",
    "sun",
    "moon",
    "star",
    "rain",
    "snow",
    "mountain",
    "river",
    "flower",
    "tree",
    "grass",
    "car",
    "Health",
    "Exercise",
    "Sleep",
    "Diet",
    "Fruit",
    "Vegetable",
    "Doctor",
    "Hospital",
    "Medicine",
    "Temperature",
    "Blood pressure",
    "Wash hands",
    "Clean",
    "Family",
    "House",
    "Room",
    "Kitchen",
    "Bedroom",
    "Garden",
    "Furniture",
    "Television",
    "Computer",
    "Telephone",
    "Pet",
    "Elderly care",
    "Retirement",
    "Senior",
    "Care",
    "Community",
    "Safety",
    "Park",
    "Walk",
    "Chess and cards",
    "Reading",
    "Music",
    "Painting",
    "Friend",
    "Chat",
    "News",
    "News",
    "Story",
    "Experience",
    "World",
    "City",
    "Countryside",
    "Weather",
    "Season",
    "Spring",
    "Summer",
    "Autumn",
    "Winter",
    "Travel",
    "Plan",
    "Passport",
    "Flight ticket",
    "Train",
    "Car",
    "Airplane",
    "Ship",
    "Hotel",
    "Luggage",
    "Map",
    "Attraction",
    "Museum",
    "Beach",
    "Mountain",
    "Lake",
    "Take photos",
    "Souvenir",
    "Adventure",
    "Relax",
    "Enjoy",
    "Breakfast",
    "Lunch",
    "Dinner",
    "Rice",
    "Noodles",
    "Bread",
    "Milk",
    "Egg",
    "Chicken",
    "Fish",
    "Coffee",
    "Tea",
    "Sugar",
    "Salt",
    "Clothes",
    "Shoes",
    "Hat",
    "Umbrella",
    "Gift",
    "Shopping",
    "Market",
    "Supermarket",
    "Price",
    "Money",
    "Time",
    "Today",
    "Tomorrow",
    "Yesterday",
    "Morning",
    "Noon",
    "Evening",
    "Weekend",
    "Festival",
    "Birthday",
    "Spring Festival",
    "Mid-Autumn Festival",
    "Study",
    "School",
    "Teacher",
    "Student",
    "Book",
    "Knowledge",
    "Language",
    "Work",
    "Company",
    "Meeting",
    "Email",
    "Project",
    "Success",
    "Help",
    "Smile",
    "Happiness",
    "Love",
    "Dream",
    "Hope",
    "Peace",
    "Nature",
    "Environment",
    "Protection",
    "Animal",
    "Dog",
    "Cat",
    "Bird",
    "Flower",
    "Tree",
    "Green",
    "Blue",
    "Red",
    "White",
    "Black",
    "Number",
    "Cold",
    "New",
    "Old",
    "Easy",
    "Difficult",
    "Start",
    "End"
  ],
  "medium": [
    "I drink a cup of coffee every morning.",
    "He goes to the supermarket to buy groceries after work.",
    "We often take a walk together on weekends.",
    "He is studying English in the library.",
    "The weather is very sunny today.",
    "Please close the window.",
    "I need to make a doctor’s appointment in advance.",
    "They are taking photos in the park.",
    "This book is very interesting.",
    "My younger sister is writing a letter to her friend.",
    "Please set your phone to silent mode.",
    "We plan to travel next month.",
    "He runs for half an hour every evening.",
    "Please send the file to my email.",
    "Grandpa practices tai chi in the park every morning.",
    "He likes to make desserts in the kitchen.",
    "Please translate this paragraph into English.",
    "We have already finished today’s tasks.",
    "He is waiting for the bus.",
    "The service at this restaurant is very good.",
    "Please speak slowly; I am taking notes.",
    "I would like to buy a train ticket to Shanghai.",
    "They are discussing plans for the weekend.",
    "I put the keys on the table.",
    "The doctor advised me to drink more water.",
    "We plan to watch a movie tonight.",
    "Please close the door gently.",
    "He is very interested in music.",
    "I have already submitted the report to the teacher.",
    "Their flight takes off tomorrow morning.",
    "Please remind me of the meeting at two in the afternoon.",
    "He is watering the plants.",
    "We need to prepare luggage for the trip.",
    "He parked the car at the school gate.",
    "Please send me this photo.",
    "I like to cook on weekends.",
    "They are visiting quietly in the museum.",
    "This piece of news has been confirmed to be true.",
    "I am going to make a phone call to my family.",
    "Please sort and throw away the trash properly.",
    "He is learning how to use the new software.",
    "It was already late when we arrived at the airport.",
    "He is preparing for the exam.",
    "The size of this piece of clothing is very suitable.",
    "Please sign the form.",
    "I plan to visit my friend tomorrow.",
    "They have already booked a hotel.",
    "The melody of this song is very beautiful.",
    "We decided to do volunteer work together on Saturday.",
    "He sent the email to the wrong address.",
    "Good morning, the weather is nice today",
    "Have you had breakfast",
    "I'm going to the supermarket to buy things",
    "Please pay attention to your health",
    "What are your plans for this weekend",
    "I like walking in the park",
    "Can you help me",
    "It's a busy day at work today",
    "I want to watch a movie tonight",
    "Do you speak English",
    "Excuse me, what time is it",
    "I'm a little tired",
    "Today is a good day",
    "Don't forget to bring the keys",
    "Drive carefully on the road",
    "Today's meeting is very important",
    "I need to take a break",
    "What sports do you like",
    "What's for dinner tonight",
    "Will it rain tomorrow",
    "Happy birthday to you",
    "I'm glad to meet you",
    "How have you been lately",
    "Please wait a moment",
    "This is a good idea",
    "I agree with you",
    "I don't quite understand",
    "Can you say it again",
    "Thank you for your help",
    "You're welcome",
    "Sorry, I'm late",
    "It doesn't matter",
    "Have a pleasant journey",
    "Take care of your health",
    "See you tomorrow",
    "Good night, sweet dreams",
    "I like drinking tea",
    "The temperature is high today",
    "Remember to drink more water",
    "This is delicious",
    "How much is it",
    "Too expensive",
    "Can it be cheaper",
    "I'll take this",
    "Where should I pay",
    "Do you need help",
    "I'm lost",
    "Where is the restroom",
    "My phone is out of battery",
    "Can I borrow your charger",
    "The network signal is poor",
    "The traffic is heavy today",
    "When will the bus come",
    "I need to take a taxi",
    "To the train station, please",
    "My flight is delayed",
    "Please keep your passport safe",
    "Have fun",
    "Take some photos",
    "The scenery is beautiful",
    "I miss home",
    "It's very lively here",
    "So many people",
    "Watch your step",
    "Keep quiet",
    "No smoking",
    "Where is the emergency exit",
    "I'm sick",
    "Need to see a doctor",
    "I have a headache",
    "Please give me medicine",
    "Have a good rest",
    "Get well soon",
    "Remember to take medicine",
    "Drink more warm water",
    "Go to the hospital for checkup",
    "Health is the most important",
    "I'm retired",
    "Enjoying life in old age",
    "Exercise every day",
    "Chat with friends",
    "Grow flowers and plants",
    "Read newspapers",
    "Play chess",
    "Go to university for the elderly",
    "There are many community activities",
    "Children are very filial",
    "Pension is sufficient",
    "Keep a happy mood",
    "Age is not a problem",
    "Very experienced",
    "Tell stories to children",
    "Take care of grandchildren",
    "Cook home-style dishes",
    "Clean the room",
    "Wash clothes",
    "Tidy up the garden",
    "Do repairs",
    "Save water",
    "Garbage sorting",
    "Save electricity",
    "Environmental protection is important",
    "Protect the environment",
    "Plant trees",
    "Reduce pollution",
    "Use public transportation",
    "Ride a bicycle",
    "Walking is good for health",
    "Eat less but more frequently",
    "Balanced diet",
    "Eat more vegetables",
    "Eat less oily food",
    "Control sugar intake",
    "Exercise appropriately",
    "Ensure enough sleep",
    "Regular physical checkups",
    "Maintain weight",
    "Quit smoking and limit alcohol",
    "Keep a peaceful mind",
    "Smile often",
    "Help others",
    "Learn new knowledge",
    "Accept new things",
    "Use smartphones",
    "Video chat",
    "Online shopping",
    "Online learning",
    "Read e-books",
    "Listen to music",
    "Watch TV series",
    "Cooking recipes",
    "Bake cakes",
    "Tea brewing skills",
    "Coffee culture",
    "Keep pets",
    "Walk the dog",
    "Feed the cat",
    "Keep fish",
    "Birds singing and flowers fragrant",
    "Spring atmosphere",
    "Hot summer",
    "Crisp autumn weather",
    "Warm winter sun",
    "Seasonal changes",
    "Quiet years",
    "Contentment brings happiness",
    "Peace is blessing",
    "May all your wishes come true",
    "Dreams come true",
    "Persistence leads to victory"
  ],
  "hard": [
    "Stars dot the night sky, like countless eyes watching over the earth.",
    "He never backs down in the face of hardship—truly steadfast and unyielding.",
    "The autumn wind brings coolness, and golden rice fields shimmer in the sunlight.",
    "His smile is like a spring breeze, refreshing and comforting to the heart.",
    "Despite the high mountains and long roads, they press forward, rain or shine.",
    "The room is filled with the scent of books; he loses himself in the ocean of knowledge.",
    "The sunset glow spills over the lake, like a golden brocade spread across the water.",
    "He speaks politely and carries himself with grace and elegance.",
    "Even if the road ahead is full of thorns, he steps forward without hesitation.",
    "The rain pours heavily, yet the streets remain bright, like a city that never sleeps.",
    "When spring blooms, the whole valley is filled with life and vitality.",
    "He is widely learned and often quotes classics in his words.",
    "Snow covers the mountains, as if draped in a silver robe.",
    "Though wind and frost mark his face, his eyes still shine brightly.",
    "A gentle breeze blows, rippling the lotus pond.",
    "His music is melodious, like a heavenly sound that enchants all who hear it.",
    "He stays true to his heart, unmoved by fame or wealth—truly admirable.",
    "Ancient road, west wind, setting sun like blood; it stirs deep emotions.",
    "His eyes are like a deep starry sky, full of mystery and tenderness.",
    "A journey of a thousand miles begins with a single step.",
    "The vast ocean tells an ancient story that has lasted forever.",
    "He writes with grace; every word is a treasure, full of literary talent.",
    "Amid the fading lights, he waits quietly, his gaze gentle.",
    "Even if storms lie ahead, he never stops moving forward.",
    "Red plum blossoms brave the snow, a symbol of strength and unyielding spirit.",
    "His clothes flutter in the wind, like an immortal descending to the world.",
    "The night is dark, and countless lights warm the human world.",
    "He treats others with sincerity and wins kindness wherever he goes.",
    "Spring rain falls gently, waking the earth and reviving all things.",
    "He forges ahead against adversity, growing braver with every setback.",
    "Summer sun burns bright; cicadas sing, bringing back childhood memories.",
    "His words are like a gentle stream, soothing to the heart.",
    "The Great Wall stands tall and winding, telling the perseverance of the Chinese nation.",
    "Even alone, he never gives up.",
    "Autumn leaves flutter down, covering the path like a golden carpet.",
    "His voice is clear and powerful, touching people deeply.",
    "As years pass by, he still keeps a sincere heart.",
    "The first light of dawn appears; dew glistens on the grass.",
    "She dances gracefully, like a crane soaring elegantly.",
    "The cold wind bites, yet it cannot dim people’s passion.",
    "His gaze is sharp, as if he can see right through people’s hearts.",
    "The river flows endlessly eastward, through thousands of years.",
    "He has a pure and extraordinary appearance that amazes everyone.",
    "Thunder roars and heavy rain pours down from the sky.",
    "With dreams in his heart, he walks firmly, unafraid of the future.",
    "Flowers bloom, butterflies dance; spring is in the air.",
    "Even in hardship, he still faces life with a smile.",
    "The long night stretches on; only books keep him company.",
    "He is kind-hearted and always ready to help others.",
    "The warm winter sun chills away the cold.",
    "Dawn breaks gently, bathing everything in golden light, like a fairyland on earth.",
    "Life is like an arduous journey; I too am a traveler, seeking meaning in the vast universe.",
    "Spring winds bring rain, nourishing all things silently—nature nurtures the earth in the softest way.",
    "A true friend near or far feels close at heart; sincere friendship crosses all mountains and rivers.",
    "Within books lie treasures untold; knowledge is the most precious wealth.",
    "How often does the bright moon appear? I raise my cup and ask the sky.",
    "Sunset clouds fly with lone wild ducks; autumn waters merge with the endless sky—a scene almost divine.",
    "After endless mountains and rivers, doubt sets in—then suddenly, a village appears. Hope hides in despair.",
    "Thousands of washes bring hardship, but only after removing sand do we find gold; truth comes through trials.",
    "To see a thousand miles farther, climb one more story—only by rising higher can you see a wider world.",
    "Seize the joy while you may; do not let your cup sit empty before the moon. Cherish the present.",
    "When you reach the peak, you’ll see all mountains small—climb high to know the world’s vastness.",
    "Picking chrysanthemums by the eastern fence, I casually see the southern mountains—peace is the true flavor of life.",
    "A time will come to ride the wind and waves, to set sail and cross the sea; ambition will achieve great things.",
    "Even a pool a thousand feet deep cannot compare to the love of a friend; true bond beats all depth.",
    "Heaven has given me talent for a purpose; a thousand gold spent will return again. Self-confidence is the first key to success.",
    "Ask why the canal is so clear—for a living spring comes from the source. Innovation keeps vitality alive.",
    "The old drunkard cares not for wine, but for the mountains and waters; true joy lies in the journey.",
    "Once you’ve seen the vast sea, other waters seem small; true excellence leaves all else ordinary.",
    "Knowledge from books is shallow; true understanding comes from doing. Practice is the test of truth.",
    "A silkworm spins until it dies; a candle burns until it melts. Dedication deserves eternal praise.",
    "You cannot know the real Lushan if you are trapped within it; step outside to see the truth clearly.",
    "A thousand sails pass by a sunken ship; ten thousand trees bloom before a withered one. Change is nature’s law.",
    "I search for her a thousand times in the crowd—then turn and find her right where the lights dim.",
    "My clothes grow loose, yet I do not regret; for her I waste away. True love is worth all sacrifice.",
    "Flowers fall, helpless; swallows return, familiar. Time passes in an endless cycle.",
    "By the river, flowers blaze redder than fire; in spring, the river turns blue as indigo. Southern spring is breathtaking.",
    "A small tower listens to spring rain all night; by dawn, apricot blossoms are sold in deep alleys—poetry in ordinary life.",
    "Apricot rain moistens clothes but does not soak them; willow wind caresses the face without chill. Spring’s gentle touch is perfect.",
    "Crystal curtains sway in the breeze; roses fill the yard with fragrance. Summer courtyard beauty enchants the soul.",
    "Sparse shadows slant across clear shallow water; subtle fragrance floats in the moonlit dusk. Plum blossoms under the moon are pure elegance.",
    "Lotus leaves stretch endlessly to the sky, glowing green; lotus flowers glow red in the sun. West Lake summer is unparalleled.",
    "I stop my carriage to admire the maple woods at dusk; frost leaves glow redder than spring flowers. Autumn maples outshine spring blooms.",
    "Suddenly, like a spring breeze overnight, thousands of trees bloom with pear blossoms—northern snow is like spring flowers.",
    "A lone sail fades into the endless blue sky; only the Yangtze River flows to the horizon. The vast river calms the heart.",
    "Straight smoke rises in the desert; the sun sets round over the long river. Frontier scenery is vast and magnificent.",
    "Waterfall plunges three thousand feet; it seems the Milky Way falls from heaven. A wonder like no other.",
    "Two orioles sing in green willows; a line of egrets flies to the blue sky. Spring bursts with life.",
    "The window frames the western mountains’ thousand-year snow; the door holds boats from east Wu. Poetry lives beyond time.",
    "Heavenly street rain moistens like cream; grass color is seen far but not near. The hazy beauty of early spring.",
    "Spring wind turns the southern shore green again; when will the bright moon shine on my return? A wanderer’s deep homesickness.",
    "Outside the bamboo, a few peach blossoms bloom; ducks know first when the spring river warms. The first sign of spring’s return.",
    "I wait to see the east wind’s face; ten thousand colors bloom—spring is the season of revival.",
    "Good rain knows its season; it falls when spring comes. Spring rain nourishes all precious things.",
    "It slips in quietly with the wind, nourishing all things silently. The best influence is gentle and unspoken.",
    "Wild paths and clouds are dark; only the boat’s fire glows on the river. A light always guides in darkness.",
    "At dawn, see the wet red places; flowers weigh heavy on Brocade City. After rain, Chengdu is even more beautiful.",
    "See the Yellow River’s waters come from heaven, rushing to the sea and never returning. Time flows away like water.",
    "See the bright mirror in the high hall mourn white hair—morning brings black hair, evening brings snow. Youth fades quickly.",
    "Life is like a dream; I pour a drink to the river and moon. Facing the universe, life feels brief.",
    "To meet the deadline, he revised the plan three times in a row.",
    "He patiently organized survey data into charts for the team to understand at a glance.",
    "Despite the strong wind outside the meeting room, everyone focused on discussing the issues at hand.",
    "To help the child understand the problem, the teacher explained it in two different ways.",
    "He jotted down scattered ideas and pieced them into a complete plan that night.",
    "Lights along the riverbank slowly turned on; strollers nodded and greeted each other.",
    "To care for his sick friend, he stayed by the hospital bed for several nights.",
    "Before the new system launched, we tested every small detail repeatedly.",
    "He compiled collected stories into a book to share at the reading club.",
    "The playground was muddy after rain, but the children still wrote passionate competition declarations.",
    "We rehearsed the speech a week early to stay calm during the ceremony.",
    "This alley twists and turns, yet hides warm little shops.",
    "He cleaned his camera lens in the dark, hoping to capture the first light of dawn.",
    "To ensure delivery quality, the team decided to stay one more day for review.",
    "He transcribed the interview recording word for word, then added details to the narration.",
    "When the child played alone on stage, he sat below, hands clenched nervously.",
    "The new curtains were drawn open; soft sunlight flooded into the living room.",
    "To avoid disturbing his family, he held phone calls in the study.",
    "He jogged along the riverbank, observing the patterns of bird activity.",
    "After long-term training, he finally maintained a steady rhythm in competitions.",
    "New books arrived at the library; readers lined up for popular titles.",
    "Father trimmed roses in the yard, occasionally looking up at the clouds.",
    "To welcome guests, Grandma carefully wiped her treasured tea set.",
    "He spent the whole night refining the presentation, making every page clean and powerful.",
    "The city subway runs back and forth; people flow regularly between platforms.",
    "That yellowed diary recorded every wish of his grandfather’s youth.",
    "To make the design closer to users, he visited more than a dozen long-term clients.",
    "He slowly simmered soup in the kitchen, filling the whole building with aroma.",
    "Classmates filmed their experiment as a short video to explain in class.",
    "He stood under the old plane tree on campus, recalling his first arrival.",
    "The train slowly exited the tunnel; sunlight flooded the carriage in an instant.",
    "To calm the child, he recorded every treatment clearly and carefully.",
    "The teacher held an umbrella by the blackboard, still explaining key steps.",
    "The wind of this city always carries a faint salty taste of the sea.",
    "He filed scattered papers one by one and attached clear labels.",
    "The ancient clock tower struck the hour; tourists raised their cameras.",
    "To save electricity, the building only lit safety lights at night.",
    "He checked the contract line by line with colleagues to ensure every clause was accurate.",
    "Cold wind swept the square; steam rose from the hot drink stall.",
    "He made a simple wind chime from plastic bottles, hanging it to listen to the wind.",
    "To keep plants from withering, the caretaker checked the flower beds morning and evening.",
    "He wrote down the day’s thoughts and posted them by his desk to stay patient.",
    "Firewood crackled gently in the stove, warming the entire room.",
    "To make the drill realistic, firefighters ran back and forth in heavy gear.",
    "He kept his mother’s handwritten recipe, planning to try it again soon.",
    "Huge ships hummed at the port; distant lighthouses guided ships home.",
    "He carefully cleaned dust from the sculpture with a small brush.",
    "To record their child’s growth, parents wrote a few lines every night before bed.",
    "Ginkgo leaves in the yard turned golden, forming a soft carpet.",
    "He donated old books to the community corner, sorting through years of memories.",
    "Music drifted slowly through the window, echoing softly in the hallway.",
    "To keep team chemistry, the coach let them continue training in the rain.",
    "He lit a small desk lamp and continued reading the unfinished chapter.",
    "Mist at the foot of the mountain lifted, revealing clear paths and streams.",
    "To help new members adapt, he compiled common questions into a guide.",
    "Steam floats in the morning market; vendors warmly greet the first customers.",
    "He stood before the canvas, carefully adjusting light and dark contrasts.",
    "To make the stage stable, staff strengthened all supports overnight.",
    "He glued travel tickets into a book—each page holds tiny memories.",
    "Moonlight spilled over the river, shaking silver spots gently.",
    "To welcome guests from far away, he prepared the guest room early.",
    "He shared experience on stage, his tone gentle yet powerful.",
    "The scent of roasted sweet potatoes fills the winter corner, making passersby stop.",
    "He carefully cut old clothes into children’s sizes to donate to the welfare home.",
    "To protect precious manuscripts, the library carefully controls temperature and humidity.",
    "He walked slowly up the mountain path, hearing pine waves in his ears.",
    "Open-air movies returned to the community; chairs filled with smiling faces.",
    "He posted the training plan on the wall to finish daily goals on time.",
    "To deliver orders on time, the driver left half an hour early.",
    "After the sweeper passed, fallen leaves lined up neatly on the street.",
    "He cleaned the borrowed tools and returned them personally to the neighbor.",
    "Thunder rolled in the distance, but the library remained quiet.",
    "To avoid unexpected power outages, we prepared backup generators.",
    "He wrote key speech points on cards, practicing tone and pauses repeatedly.",
    "Raindrops fell on the metal roof, making a complex rhythm.",
    "He stood by the display, answering every visitor’s question patiently.",
    "To keep the garden tidy, the gardener tied and carried away dead branches.",
    "He wrote blessings on the envelope, wishing his traveling friend a safe journey.",
    "The early morning train passed through the city; windows reflected countless sleeping lights.",
    "He sent after-class exercises online, reminding students to submit on time.",
    "To fix the old radio, he looked up many outdated materials."
    ]
  }
