{
  "easy": [
    "apple",
    "banana",
    "watermelon",
    "grape",
    "orange",
    "table",
    "chair",
    "window",
    "bed",
    "book",
    "pen",
    "paper",
    "mobile phone",
    "computer",
    "dog",
    "cat",
    "bird",
    "fish",
    "rabbit",
    "red",
    "blue",
    "green",
    "yellow",
    "black",
    "milk",
    "water",
    "tea",
    "coffee",
    "juice",
    "father",
    "mother",
    "older brother",
    "older sister",
    "younger brother",
    "younger sister",
    "friend",
    "teacher",
    "classmate",
    "child",
    "sun",
    "moon",
    "star",
    "rain",
    "snow",
    "mountain",
    "river",
    "flower",
    "tree",
    "grass",
    "car",
    "Health",
    "Exercise",
    "Sleep",
    "Diet",
    "Fruit",
    "Vegetable",
    "Doctor",
    "Hospital",
    "Medicine",
    "Temperature",
    "Blood pressure",
    "Wash hands",
    "Clean",
    "Family",
    "House",
    "Room",
    "Kitchen",
    "Bedroom",
    "Garden",
    "Furniture",
    "Television",
    "Computer",
    "Telephone",
    "Pet",
    "Elderly care",
    "Retirement",
    "Senior",
    "Care",
    "Community",
    "Safety",
    "Park",
    "Walk",
    "Chess and cards",
    "Reading",
    "Music",
    "Painting",
    "Friend",
    "Chat",
    "News",
    "News",
    "Story",
    "Experience",
    "World",
    "City",
    "Countryside",
    "Weather",
    "Season",
    "Spring",
    "Summer",
    "Autumn",
    "Winter",
    "Travel",
    "Plan",
    "Passport",
    "Flight ticket",
    "Train",
    "Car",
    "Airplane",
    "Ship",
    "Hotel",
    "Luggage",
    "Map",
    "Attraction",
    "Museum",
    "Beach",
    "Mountain",
    "Lake",
    "Take photos",
    "Souvenir",
    "Adventure",
    "Relax",
    "Enjoy",
    "Breakfast",
    "Lunch",
    "Dinner",
    "Rice",
    "Noodles",
    "Bread",
    "Milk",
    "Egg",
    "Chicken",
    "Fish",
    "Coffee",
    "Tea",
    "Sugar",
    "Salt",
    "Clothes",
    "Shoes",
    "Hat",
    "Umbrella",
    "Gift",
    "Shopping",
    "Market",
    "Supermarket",
    "Price",
    "Money",
    "Time",
    "Today",
    "Tomorrow",
    "Yesterday",
    "Morning",
    "Noon",
    "Evening",
    "Weekend",
    "Festival",
    "Birthday",
    "Spring Festival",
    "Mid-Autumn Festival",
    "Study",
    "School",
    "Teacher",
    "Student",
    "Book",
    "Knowledge",
    "Language",
    "Work",
    "Company",
    "Meeting",
    "Email",
    "Project",
    "Success",
    "Help",
    "Smile",
    "Happiness",
    "Love",
    "Dream",
    "Hope",
    "Peace",
    "Nature",
    "Environment",
    "Protection",
    "Animal",
    "Dog",
    "Cat",
    "Bird",
    "Flower",
    "Tree",
    "Green",
    "Blue",
    "Red",
    "White",
    "Black",
    "Number",
    "Cold",
    "New",
    "Old",
    "Easy",
    "Difficult",
    "Start",
    "End"
  ],
  "medium": [
    "I drink a cup of coffee every morning.",
    "He goes to the supermarket to buy groceries after work.",
    "We often take a walk together on weekends.",
    "He is studying English in the library.",
    "The weather is very sunny today.",
    "Please close the window.",
    "I need to make a doctor’s appointment in advance.",
    "They are taking photos in the park.",
    "This book is very interesting.",
    "My younger sister is writing a letter to her friend.",
    "Please set your phone to silent mode.",
    "We plan to travel next month.",
    "He runs for half an hour every evening.",
    "Please send the file to my email.",
    "Grandpa practices tai chi in the park every morning.",
    "He likes to make desserts in the kitchen.",
    "Please translate this paragraph into English.",
    "We have already finished today’s tasks.",
    "He is waiting for the bus.",
    "The service at this restaurant is very good.",
    "Please speak slowly; I am taking notes.",
    "I would like to buy a train ticket to Shanghai.",
    "They are discussing plans for the weekend.",
    "I put the keys on the table.",
    "The doctor advised me to drink more water.",
    "We plan to watch a movie tonight.",
    "Please close the door gently.",
    "He is very interested in music.",
    "I have already submitted the report to the teacher.",
    "Their flight takes off tomorrow morning.",
    "Please remind me of the meeting at two in the afternoon.",
    "He is watering the plants.",
    "We need to prepare luggage for the trip.",
    "He parked the car at the school gate.",
    "Please send me this photo.",
    "I like to cook on weekends.",
    "They are visiting quietly in the museum.",
    "This piece of news has been confirmed to be true.",
    "I am going to make a phone call to my family.",
    "Please sort and throw away the trash properly.",
    "He is learning how to use the new software.",
    "It was already late when we arrived at the airport.",
    "He is preparing for the exam.",
    "The size of this piece of clothing is very suitable.",
    "Please sign the form.",
    "I plan to visit my friend tomorrow.",
    "They have already booked a hotel.",
    "The melody of this song is very beautiful.",
    "We decided to do volunteer work together on Saturday.",
    "He sent the email to the wrong address.",
    "Good morning, the weather is nice today",
    "Have you had breakfast",
    "I'm going to the supermarket to buy things",
    "Please pay attention to your health",
    "What are your plans for this weekend",
    "I like walking in the park",
    "Can you help me",
    "It's a busy day at work today",
    "I want to watch a movie tonight",
    "Do you speak English",
    "Excuse me, what time is it",
    "I'm a little tired",
    "Today is a good day",
    "Don't forget to bring the keys",
    "Drive carefully on the road",
    "Today's meeting is very important",
    "I need to take a break",
    "What sports do you like",
    "What's for dinner tonight",
    "Will it rain tomorrow",
    "Happy birthday to you",
    "I'm glad to meet you",
    "How have you been lately",
    "Please wait a moment",
    "This is a good idea",
    "I agree with you",
    "I don't quite understand",
    "Can you say it again",
    "Thank you for your help",
    "You're welcome",
    "Sorry, I'm late",
    "It doesn't matter",
    "Have a pleasant journey",
    "Take care of your health",
    "See you tomorrow",
    "Good night, sweet dreams",
    "I like drinking tea",
    "The temperature is high today",
    "Remember to drink more water",
    "This is delicious",
    "How much is it",
    "Too expensive",
    "Can it be cheaper",
    "I'll take this",
    "Where should I pay",
    "Do you need help",
    "I'm lost",
    "Where is the restroom",
    "My phone is out of battery",
    "Can I borrow your charger",
    "The network signal is poor",
    "The traffic is heavy today",
    "When will the bus come",
    "I need to take a taxi",
    "To the train station, please",
    "My flight is delayed",
    "Please keep your passport safe",
    "Have fun",
    "Take some photos",
    "The scenery is beautiful",
    "I miss home",
    "It's very lively here",
    "So many people",
    "Watch your step",
    "Keep quiet",
    "No smoking",
    "Where is the emergency exit",
    "I'm sick",
    "Need to see a doctor",
    "I have a headache",
    "Please give me medicine",
    "Have a good rest",
    "Get well soon",
    "Remember to take medicine",
    "Drink more warm water",
    "Go to the hospital for checkup",
    "Health is the most important",
    "I'm retired",
    "Enjoying life in old age",
    "Exercise every day",
    "Chat with friends",
    "Grow flowers and plants",
    "Read newspapers",
    "Play chess",
    "Go to university for the elderly",
    "There are many community activities",
    "Children are very filial",
    "Pension is sufficient",
    "Keep a happy mood",
    "Age is not a problem",
    "Very experienced",
    "Tell stories to children",
    "Take care of grandchildren",
    "Cook home-style dishes",
    "Clean the room",
    "Wash clothes",
    "Tidy up the garden",
    "Do repairs",
    "Save water",
    "Garbage sorting",
    "Save electricity",
    "Environmental protection is important",
    "Protect the environment",
    "Plant trees",
    "Reduce pollution",
    "Use public transportation",
    "Ride a bicycle",
    "Walking is good for health",
    "Eat less but more frequently",
    "Balanced diet",
    "Eat more vegetables",
    "Eat less oily food",
    "Control sugar intake",
    "Exercise appropriately",
    "Ensure enough sleep",
    "Regular physical checkups",
    "Maintain weight",
    "Quit smoking and limit alcohol",
    "Keep a peaceful mind",
    "Smile often",
    "Help others",
    "Learn new knowledge",
    "Accept new things",
    "Use smartphones",
    "Video chat",
    "Online shopping",
    "Online learning",
    "Read e-books",
    "Listen to music",
    "Watch TV series",
    "Cooking recipes",
    "Bake cakes",
    "Tea brewing skills",
    "Coffee culture",
    "Keep pets",
    "Walk the dog",
    "Feed the cat",
    "Keep fish",
    "Birds singing and flowers fragrant",
    "Spring atmosphere",
    "Hot summer",
    "Crisp autumn weather",
    "Warm winter sun",
    "Seasonal changes",
    "Quiet years",
    "Contentment brings happiness",
    "Peace is blessing",
    "May all your wishes come true",
    "Dreams come true",
    "Persistence leads to victory"
  ],
  "hard": [
    "Stars dotted the night sky, as if countless eyes were gazing at the earth.",
    "He never flinched in the face of hardship, truly demonstrating unyielding resilience.",
    "The autumn breeze was refreshing, and the golden rice fields shimmered under the sunlight.",
    "Her smile was like a spring breeze brushing the face, filling people with joy.",
    "Despite the high mountains and long roads, they still moved forward through wind and rain.",
    "With the fragrance of books filling the room, he was lost in the ocean of knowledge.",
    "The setting sun cast its glow on the lake, like a golden brocade spread out.",
    "He spoke with courtesy, and her manners radiated elegance and grace.",
    "Even though the path ahead was full of thorns, he embarked without hesitation.",
    "The heavy rain poured down, yet the streets were brightly lit, as if in a sleepless city.",
    "When spring arrived, the whole valley was filled with vibrant vitality.",
    "He was well-read, always quoting classics in his speech.",
    "The snow-covered mountains looked as if draped in a silver robe.",
    "Even with a weathered face, his eyes still shone brightly.",
    "As the breeze blew gently, ripples spread across the lotus pond.",
    "Her music was melodious, like a heavenly sound, enchanting all who listened.",
    "He stayed true to his original aspirations, unmoved by fame or fortune, earning respect.",
    "An ancient road under the west wind and a bloody sunset stirred countless emotions.",
    "Her eyes were like the deep night sky, full of mystery and tenderness.",
    "A journey of a thousand miles begins with a single step.",
    "The vast sea seemed to be telling eternal stories.",
    "With each stroke of his brush, he wrote words like pearls, showing literary brilliance.",
    "Amid the dim lights, He waited quietly with gentle eyes.",
    "Even when storms raged ahead, he never stopped moving forward.",
    "The red plum blossoms defied the snow, symbolizing resilience and perseverance.",
    "Her flowing dress made her look like a fairy descending to earth.",
    "The night was like ink, with countless lights reflecting human warmth.",
    "He treated others with sincerity and made many good connections.",
    "The continuous spring rain awakened the earth and revived all living things.",
    "He forged ahead in adversity, growing braver with each setback.",
    "The cicadas in the hot summer brought back memories of childhood.",
    "Her words were like a gentle stream, refreshing the heart.",
    "The majestic Great Wall stretched endlessly, telling the story of the nation’s resilience.",
    "Even when alone, he never gave up.",
    "Falling autumn leaves covered the path like a golden carpet.",
    "Her singing was clear and powerful, touching the hearts of listeners.",
    "Even as the years passed, he still kept his pure heart.",
    "As the morning light appeared, dewdrops sparkled on the grass.",
    "Her graceful dance resembled the elegant flight of a crane.",
    "The biting cold wind could not stop people's enthusiasm.",
    "His gaze was sharp as a torch, as if he could see through people's hearts.",
    "The river flowed eastward endlessly, for thousands of years without stopping.",
    "Her beauty was elegant and extraordinary, leaving people in awe.",
    "Thunder roared as the rain poured down heavily.",
    "With dreams in his heart and steady steps, he feared no future.",
    "Blossoms bloomed splendidly as butterflies danced, full of spring vitality.",
    "Even in hardship, he still faced life with a smile.",
    "During the long nights, only books kept him company.",
    "He was kind-hearted and always willing to help others.",
    "The warm winter sun shone on them, dispelling the cold.",
    "At the break of dawn, all things bathe in golden radiance, as if a fairyland has descended upon the mortal world",
    "Life is like a journey against the current, I too am a traveler, seeking the meaning of existence in this vast universe",
    "Spring breeze turns into rain, moistening things silently, nature nourishes the earth in the gentlest way",
    "If you have a friend who knows your heart, distance cannot keep you apart, true friendship can transcend mountains and rivers",
    "In books are found houses of gold, in books are found beauties fair, knowledge is the most precious treasure",
    "How long will the bright moon appear? Winecup in hand, I ask the sky, wondering what year it is in the celestial palaces tonight",
    "Lone wild ducks fly together with sunset clouds, autumn river shares same color with vast sky, such scenery should only exist in heaven",
    "Beyond hills and rills I doubt if there's a road, another village comes in sight amid shaded willows, opportunities often hide in desperate situations",
    "After thousands of washings and siftings, gold finally emerges from the sand, truth reveals itself only through hardships",
    "If you desire a view of a thousand miles, ascend yet another floor, only by continuous climbing can one see broader horizons",
    "When life goes well, be joyfully drunk, never let the golden cup empty under the moon, cherish the present beautiful moments",
    "I must ascend the mountain's crest, it dwarfs all peaks under my feet, only by reaching heights can one appreciate the vastness of heaven and earth",
    "Plucking chrysanthemums under the eastern hedge, I see the southern hills in tranquility, simplicity and leisure are the true essence of life",
    "I will mount a long wind some day and break the heavy waves, and set my cloudy sail straight to cross the sea, great ambitions will surely achieve great deeds",
    "However deep the Lake of Peach Blossoms may be, it's not so deep as Wang Lun's love for me, true friendship surpasses a thousand-foot deep pool",
    "Heaven has endowed me with talents for eventual use, my scattered gold will come back again, confidence is the first secret of success",
    "I ask how the river can be so clear, from the source the living water flows, only continuous innovation can maintain vitality",
    "The old drunkard's interest is not in wine, but in the landscape between, true pleasure often lies in the process",
    "No water's wide enough when you have crossed the sea, no cloud is beautiful but that which crowns the peak, having experienced the best, all else seems ordinary",
    "Knowledge from books is shallow indeed, true understanding requires personal practice, practice is the sole criterion for testing truth",
    "Spring silkworms spin silk until death, candles weep tears until they turn to ash, the spirit of dedication deserves eternal praise",
    "I can't tell the true shape of Lu Mountain, because I myself am in the mountain, sometimes we need to break out of limitations to see the essence",
    "Past the sunken ship, a thousand sails pass; beyond the withered tree, ten thousand saplings grow, the replacement of old with new is an eternal natural law",
    "Searching for her in the crowd a thousand times, suddenly turning, she's there where lantern light dims",
    "I languish away without regret, for her I become haggard and worn, true love is worth everything",
    "Flowers fall, do what one may; swallows return, no strangers they, the passage of time contains eternal cycles",
    "Sunrise evokes flowers redder than fire, spring river water greener than blue, the spring scenery south of Yangtze is overwhelmingly beautiful",
    "All night in little tower I heard spring rain, tomorrow morn deep lane will sell apricot flowers, poetic charm exists in ordinary life",
    "Apricot rain wets not my clothes, willow wind chills not my face, spring drizzle and breeze are most pleasant",
    "Crystal curtain stirs in gentle breeze, full trellis of roses fills courtyard with fragrance, summer courtyard beauty is intoxicating",
    "Sparse shadows slant across clear shallow water, subtle fragrance floats in moonlit dusk, moonlit plum shadows with subtle fragrance are most elegant",
    "Lotus leaves stretch to infinity under sky, lotus blossoms glow uniquely red in sunshine, West Lake's summer scenery is unparalleled under heaven",
    "I stop my carriage to admire maple woods at night, frosty leaves are redder than spring flowers, autumn maple red surpasses spring blossoms",
    "Suddenly overnight spring wind arrives, thousands of pear trees blossom as if covered with snow, northern snow scenery resembles spring pear blossoms",
    "Lone sail distant shadow vanishes in blue sky, only see Yangtze River flow to heaven's edge, magnificent river scenery refreshes heart and mind",
    "In vast desert lonely smoke rises straight, over long river sets the round sun, frontier scenery is vast and magnificent",
    "Flying waters descend straight three thousand feet, till I wonder if it's the Milky Way falling from heaven, waterfall wonder seems like water from heaven",
    "Two golden orioles sing amid the willows green, a row of white egrets flies into blue sky, vibrant spring scenery full of vitality",
    "My window frames the western hills' thousand-year snow, my door moors east-bound Wu's thousand miles ships, poetic imagery transcends time and space",
    "Royal Street spring rain moistens like cream, grass colors seen from afar yet disappear up close, the hazy beauty in early spring drizzle",
    "Spring breeze again greens the southern river bank, when will moonlight shine on my return, the deep homesickness of a wanderer",
    "Beyond bamboo grove several peach branches bloom, ducks know first when river water warms in spring, the first signal of spring's return to earth",
    "Easily I recognize east wind's face, thousands of purples and reds always signal spring, spring is the season of everything comes back to life.",
    "Good rain knows its season, comes with spring in reason, spring rain is precious as oil nourishing all things",
    "Following wind it steals into night, moistening things silently without sound, the best education often influences subtly",
    "Clouds darken all paths in wilderness, only fishing boat lights shine on river, there's always a guiding light in darkness",
    "At dawn see red-wet places, flowers heavy weigh down Brocade City, Chengdu becomes more beautiful after rain",
    "See how the Yellow River's waters move out of heaven, rushing to sea never to return, time flows away like water never to return",
    "See how lovely locks in bright mirrors in high chambers, though silken-black at morning, have changed by night to snow, youth fades easily, time is merciless",
    "Life is but a dream, I pour libation to the river moon, facing the vast universe makes one feel life is shot."
  ]
}