{
  "easy": [
    "apple",
    "banana",
    "watermelon",
    "grape",
    "orange",
    "table",
    "chair",
    "door",
    "window",
    "bed",
    "book",
    "pen",
    "paper",
    "mobile phone",
    "computer",
    "dog",
    "cat",
    "bird",
    "fish",
    "rabbit",
    "red",
    "blue",
    "green",
    "yellow",
    "black",
    "milk",
    "water",
    "tea",
    "coffee",
    "juice",
    "father",
    "mother",
    "older brother",
    "older sister",
    "younger brother",
    "younger sister",
    "friend",
    "teacher",
    "classmate",
    "child",
    "sun",
    "moon",
    "star",
    "rain",
    "snow",
    "mountain",
    "river",
    "flower",
    "tree",
    "grass"
  ],
  "medium": [
    "I drink a cup of coffee every morning.",
    "He goes to the supermarket to buy groceries after work.",
    "We often take a walk together on weekends.",
    "She is studying English in the library.",
    "The weather is very sunny today.",
    "Please close the window.",
    "I need to make a doctor’s appointment in advance.",
    "They are taking photos in the park.",
    "This book is very interesting.",
    "My younger sister is writing a letter to her friend.",
    "Please set your phone to silent mode.",
    "We plan to travel next month.",
    "He runs for half an hour every evening.",
    "Please send the file to my email.",
    "Grandpa practices tai chi in the park every morning.",
    "She likes to make desserts in the kitchen.",
    "Please translate this paragraph into English.",
    "We have already finished today’s tasks.",
    "He is waiting for the bus.",
    "The service at this restaurant is very good.",
    "Please speak slowly; I am taking notes.",
    "I would like to buy a train ticket to Shanghai.",
    "They are discussing plans for the weekend.",
    "I put the keys on the table.",
    "The doctor advised me to drink more water.",
    "We plan to watch a movie tonight.",
    "Please close the door gently.",
    "He is very interested in music.",
    "I have already submitted the report to the teacher.",
    "Their flight takes off tomorrow morning.",
    "Please remind me of the meeting at two in the afternoon.",
    "She is watering the plants.",
    "We need to prepare luggage for the trip.",
    "He parked the car at the school gate.",
    "Please send me this photo.",
    "I like to cook on weekends.",
    "They are visiting quietly in the museum.",
    "This piece of news has been confirmed to be true.",
    "I am going to make a phone call to my family.",
    "Please sort and throw away the trash properly.",
    "She is learning how to use the new software.",
    "It was already late when we arrived at the airport.",
    "He is preparing for the exam.",
    "The size of this piece of clothing is very suitable.",
    "Please sign the form.",
    "I plan to visit my friend tomorrow.",
    "They have already booked a hotel.",
    "The melody of this song is very beautiful.",
    "We decided to do volunteer work together on Saturday.",
    "He sent the email to the wrong address."
  ],
  "hard": [
    "Stars dotted the night sky, as if countless eyes were gazing at the earth.",
    "He never flinched in the face of hardship, truly demonstrating unyielding resilience.",
    "The autumn breeze was refreshing, and the golden rice fields shimmered under the sunlight.",
    "Her smile was like a spring breeze brushing the face, filling people with joy.",
    "Despite the high mountains and long roads, they still moved forward through wind and rain.",
    "With the fragrance of books filling the room, he was lost in the ocean of knowledge.",
    "The setting sun cast its glow on the lake, like a golden brocade spread out.",
    "She spoke with courtesy, and her manners radiated elegance and grace.",
    "Even though the path ahead was full of thorns, he embarked without hesitation.",
    "The heavy rain poured down, yet the streets were brightly lit, as if in a sleepless city.",
    "When spring arrived, the whole valley was filled with vibrant vitality.",
    "He was well-read, always quoting classics in his speech.",
    "The snow-covered mountains looked as if draped in a silver robe.",
    "Even with a weathered face, his eyes still shone brightly.",
    "As the breeze blew gently, ripples spread across the lotus pond.",
    "Her music was melodious, like a heavenly sound, enchanting all who listened.",
    "He stayed true to his original aspirations, unmoved by fame or fortune, earning respect.",
    "An ancient road under the west wind and a bloody sunset stirred countless emotions.",
    "Her eyes were like the deep night sky, full of mystery and tenderness.",
    "A journey of a thousand miles begins with a single step.",
    "The vast sea seemed to be telling eternal stories.",
    "With each stroke of his brush, he wrote words like pearls, showing literary brilliance.",
    "Amid the dim lights, she waited quietly with gentle eyes.",
    "Even when storms raged ahead, he never stopped moving forward.",
    "The red plum blossoms defied the snow, symbolizing resilience and perseverance.",
    "Her flowing dress made her look like a fairy descending to earth.",
    "The night was like ink, with countless lights reflecting human warmth.",
    "He treated others with sincerity and made many good connections.",
    "The continuous spring rain awakened the earth and revived all living things.",
    "He forged ahead in adversity, growing braver with each setback.",
    "The cicadas in the hot summer brought back memories of childhood.",
    "Her words were like a gentle stream, refreshing the heart.",
    "The majestic Great Wall stretched endlessly, telling the story of the nation’s resilience.",
    "Even when alone, he never gave up.",
    "Falling autumn leaves covered the path like a golden carpet.",
    "Her singing was clear and powerful, touching the hearts of listeners.",
    "Even as the years passed, he still kept his pure heart.",
    "As the morning light appeared, dewdrops sparkled on the grass.",
    "Her graceful dance resembled the elegant flight of a crane.",
    "The biting cold wind could not stop people's enthusiasm.",
    "His gaze was sharp as a torch, as if he could see through people's hearts.",
    "The river flowed eastward endlessly, for thousands of years without stopping.",
    "Her beauty was elegant and extraordinary, leaving people in awe.",
    "Thunder roared as the rain poured down heavily.",
    "With dreams in his heart and steady steps, he feared no future.",
    "Blossoms bloomed splendidly as butterflies danced, full of spring vitality.",
    "Even in hardship, he still faced life with a smile.",
    "During the long nights, only books kept him company.",
    "She was kind-hearted and always willing to help others.",
    "The warm winter sun shone on them, dispelling the cold."
  ]
}
